---
kind: property
id: P:Autodesk.Revit.DB.ModelText.HorizontalAlignment
source: html/124b6edf-1f23-13a7-1aac-9cdd810000cc.htm
---
# Autodesk.Revit.DB.ModelText.HorizontalAlignment Property

The horizontal alignment.

## Syntax (C#)
```csharp
public HorizontalAlign HorizontalAlignment { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when an invalid value is assigned to the property.